Autodesk.Revit.DB.IFC.IFCAggregate.GetEDMSelect(System.Int32)
Gets the data value in the specified aggregate element.
index:
The index.
Returns:
The data value.
Since:
2013

Autodesk.Revit.DB.IFC.IFCAggregate.Add(Autodesk.Revit.DB.IFC.IFCData)
Adds an element to the aggregate.
ifcData:
The IFCData element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The aggregate is not valid.
Since:
2013